Repository: SamerOrfali22/trade_test
Catalog: lib/l10n/intl_*.arb
Languages: ar

# no_internet_connection
source: Unable to connect to the internet
ar: غير قادر على الاتصال بالانترنت

# no_internet_connection_message
source: Please check you internet connection and go online to resume
ar: يرجى التحقق من اتصالك بالإنترنت والاتصال بالإنترنت للاستئناف

source: retry
ar: إعادة المحاولة

source: Theme
ar: الموضوع

source: Language
ar: اللغة

source: Settings
ar: الإعدادات

source: Update
ar: تحديث

# msg_app_update
source: Please update the app to version {version}
ar: يرجى تحديث التطبيق إلى الإصدار {version}

# general_error
source: Something went wrong, please retry
ar: حدث خطأ ما ، الرجاء المحاولة مرة أخرى

source: Continue
ar: المتابعة

source: Cancel
ar: إلغاء

# empty_data
source: No data found
ar: لايوجد معلومات

source: About
ar: حول

# backend_url
source: Backend Url: {url}
ar: رابط المخدم: {url}

# build
source: Version: {version}
ar: نسخة: {version}

# current_date
source: Current Date: {date}
ar: التاريخ الحالي: {date}

# current_day
source: Current Day: {day}
ar: اليوم الحالي : {day}

source: Test Crashlytics
ar: اختبار Crashlytics

source: Products
ar: منتجات

source: Open Example
ar: افتح المثال

source: Cart
ar: عربة التسوق

source: Search Products
ar: ابحث عن المنتجات

source: Reset Category
ar: حذف النوع

# cart_details
source: Cart {id} Details
ar: تفاصيل العربة {id}

# cart_id
source: id : {id}
ar: المعرف : {id}

# cart_user_id
source: user id : {id}
ar: معرف المستخدم : {id}

# total
source: total : {total}
ar: المجموع : {total}

# total_discount
source: total discount : {totalDiscount}
ar: مجموع الخصم : {totalDiscount}

# total_products
source: total products : {totalProducts}
ar: عدد المنتجات : {totalProducts}

# total_quantity
source: total quantity : {totalQuantity}
ar: الكمية الكلية : {totalQuantity}
